* typescript example
:PROPERTIES:
:CUSTOM_ID: typescript-example
:END:
** literal value types
:PROPERTIES:
:CUSTOM_ID: literal-value-types
:END:
#+begin_src typescript
let restrictdValue: 1 | 2 | 3 = 3;

function getRandomValue(): 1 | 2 | 3 | 4 {
    return Math.floor(Math.random() * 4) + 1 as 1 | 2 | 3 | 4;
}
#+end_src

** optional property
:PROPERTIES:
:CUSTOM_ID: optional-property
:END:
#+begin_src typescript
let hat = { name: "Hat", price: 100 };
let gloves = { name: "Gloves", price: 75 };
let umbrella = { name: "Umbrella", price: 30,
        hasFeature: (feature) => feature === Feature.Waterproof };
let mirrorShades = { name: "Sunglasses", price: 54, finish: "mirrored"};
let darkShades: Product = { name: "Sunglasses", price: 54, finish: "flat"};
let products: Product[] = [hat, gloves, umbrella, mirrorShades, darkShades];
products.forEach(prod => console.log(`${prod.name}: ${prod.price} `
    + `${ prod.hasFeature ? prod.hasFeature(Feature.Waterproof) : "false" }`));
#+end_src

** types system
:PROPERTIES:
:CUSTOM_ID: types-system
:END:
#+begin_src typescript
boolean
number
string
void
null
undefined
object
any
unknown
never
symbol
#+end_src

** use grapheme-splitter to split non-ascii string
:PROPERTIES:
:CUSTOM_ID: use-grapheme-splitter-to-split-non-ascii-string
:END:
** apply, call, and bind
:PROPERTIES:
:CUSTOM_ID: apply-call-and-bind
:END:
#+begin_src typescript
function add(a: number, b: number): void {
    console.log("a + b is " + (a + b));
}

add(10, 20);
add.apply(null, [10, 20]);
add.call(null, 10, 20);
add.bind(null, 10, 20)()
#+end_src

#+RESULTS:
: a + b is 30
: a + b is 30
: a + b is 30
: a + b is 30
